Revit 2023 API
GroupTypeId.PrimaryUnits Property
 "Primary Units"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId PrimaryUnits { get; }
Visual Basic
Public Shared ReadOnly Property PrimaryUnits As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PrimaryUnits {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace